<template>
    <div class="page">
        <h2>社交项目 用户行为规范</h2>
        <div class="content">
            <div>更新日期：2022/09/18</div>
            <div>生效日期：2022/09/18</div>
        </div>

        <h2>引言</h2>
        <div class="content">
            <span class="point">“社交项目”</span>是一个供广大用户建立美好关系的平台，一直坚守着善意、平等、真实、自由、表达的核心价值观。长久以来，<span
                class="point">“社交项目”</span>一直致力于弘扬社会主义核心价值观，传播正能量和构建天朗气清的网络空间，这个目标离不开每一位用户的努力。
            为此，特制定《社交项目用户行为规范》（以下简称“本规范”），由所有<span class="point">“社交项目”</span>用户共同遵守。用户在<span
                class="point">“社交项目”</span>内发布、传播、参与互动的内容，均应当符合本行为规范。用户违规行为将分为三个等级：P0、P1、P2（按照违规程度由重到轻），每一个违规等级对应不同的违规内容及处罚方式。除对违规用户进行相关处罚外，本平台还有权视情况予以公示违规用户名单（包括昵称、违规原因和处罚结果）。具体如下：
        </div>

        <h3>一、P0 - 严重违规行为</h3>
        <div class="content">
            <p>用户在本平台内的行为及发布的文字、图片、语音及视频等内容，涉及违反法律法规的内容时，定义为P0级违规行为。违规内容包括但不限于：</p>
            <h4>1、涉政内容相关</h4>
            <p>（1）违反宪法所确定的基本原则的；</p>
            <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
            <p>（3）损害国家荣誉和利益的，如损害国旗国徽形象的；</p>
            <p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
            <p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
            <p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
            <p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
            <p>（8）宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；</p>
            <p>（9）侮辱滥用英烈形象，否定歪曲英烈事迹，美化或粉饰侵略者和侵略战争行为；</p>
            <p>（10）攻击诋毁党和国家领导人，捏造领导人负面信息，滥用领导人形象的；</p>
            <p>（11）含有法律、行政法规禁止的其他内容的。</p>

            <h4>2、色情相关</h4>
            <p>（1）直接暴露性器官和刻意描写人体性部位的内容；</p>
            <p>（2）隐私部位未着衣物，仅用肢体等掩盖隐私部位的内容；</p>
            <p>（3）带有侵犯个人隐私性质的走光、偷拍、漏点等内容；</p>
            <p>（4）相关部门禁止传播的色情和有伤社会风化的文字、音视频内容，包括一些电影的删节片段；</p>
            <p>（5）传播危害社会公德、违反伦理的不正当性关系信息；</p>
            <p>（6）非法的性药品广告；</p>
            <p>（7）推介淫秽色情网站；</p>
            <p>（8）涉及有偿陪侍。</p>
            <p>（9）发布畸形情感内容，如恋童癖、乱伦等内容；</p>
            <p>（10）发布性交易、色情交易内容。</p>

            <h4>3、欺诈赌博相关</h4>
            <p>（1）发布欺诈信息，如假冒官方客服、正规网站，以短信、站内私信或链接等形式提示虚假中奖信息，设计“杀猪盘”类欺诈行为等；</p>
            <p>（2）提供赌博交易平台信息或赌博性质类服务，如赌博平台链接、币商、中介、游戏币回收等；</p>
            <p>（3）涉及赌博技巧、赌博器具等赌博内容，如老虎机、透视扑克等；</p>
            <p>（4）欺诈用户行为，如免费送东西骗邮费、免费领养宠物、免费抽奖等。</p>

            <h4>4、未成年人保护相关</h4>
            <p>（1）涉及未成年人不良身心发展的，如展示未成年人早恋、婚育等；</p>
            <p>（2）涉及未成年人暴力欺凌的，如校园暴力、网络霸凌、社会犯罪等；</p>
            <p>（3）涉及披露未成年人隐私的，如展示未成年人性器官，公开个人隐私等；</p>
            <p>（4）涉及未成年人不良行为的，如宗教传授、饮酒吸烟、邪典动画等；</p>
            <p>（5）涉及规避未成年人系统监管的，如故意规避青少年模式的方法攻略等；</p>
            <p>（6）其他危害未成年人安全和健康的相关内容。</p>

            <h4>5、其他违法内容相关</h4>
            <p>（1）涉及违禁物品，包括但不限于：毒品、违禁药物、枪支、管制刀具、保护文物、保护动物、烟花爆竹等；</p>
            <p>（2）涉及违禁活动，包括但不限于：传销、买卖人体器官、贩卖妇女儿童等；</p>
            <p>（3）涉及违法服务，包括但不限于：非法医疗服务、非法通讯服务、各类证件造假、提供作弊工具及软件、私家侦探等；</p>
            <p>（4）涉及侵害他人隐私，包括但不限于：未经他人许可，公布他人个人身份信息、社会关系、财产情况、个人秘密等。</p>
            <p>
                （5）涉及侵犯他人著作权，包括但不限于：未经著作权人许可，发表其作品的； 未经合作作者许可，将与他人合作创作的作品当作自己单独创作的作品发表的；
                没有参加创作，为谋取个人名利，在他人作品上署名的； 歪曲、篡改他人作品的； 剽窃他人作品的；
            </p>

            <p class="decoration"></p>
            <p>处罚方式：删除违规内容, 视情节严重程度，封禁账号相关权限15天-永久关闭账号</p>
            <p class="decoration"></p>
            <p>注：若涉及诈骗赌博、违法物品及服务内容，平台将没收所有虚拟财产并上报有关部门；若涉及违法行为，平台将积极配合警方调查处理。</p>
        </div>

        <h3>二、P1 - 中度违规行为</h3>
        <div class="content">
            <p>用户本平台内发布的文字、图片、语音及视频等内容，涉及恶意引流、诱导交易、散播谣言、不良价值观等内容时，定义为P1级违规行为。违规内容包括但不限于：</p>
            <p>1、带有性暗示、性挑逗等易使人产生性联想等；</p>
            <p>2、以宣传、售卖为导向的广告行为，如发布广告相关信息、宣传个人店铺的产品、发布会员招募、人员招聘、兼职等；</p>
            <p>3、粮食浪费，如大胃王吃播视频、过度餐饮图片、宣扬铺张享乐主义的言论等；</p>
            <p>4、各类有偿技能服务，如摄影约拍、技能教学等；</p>
            <p>5、VPN相关，如分享VPN软件、询问VPN软件、出售VPN软件等；</p>
            <p>6、算命、占卜相关的，如分享自己算命结果、主动为他人算命占卜等；</p>
            <p>7、网乞行为（无交易性质），如要求其他用户帮点外卖、买化妆品、买衣服等；</p>
            <p>8、调侃恶搞自然灾害、重大事故等灾难的。</p>
            <p>9、含人身攻击、骚扰他人的内容，如辱骂、侮辱、恶意引战（包括故意挑唆男女对立等）、故意骚扰、等；</p>
            <p>10、严重影响用户体验的内容，如图片血腥恐怖、恶心瘆人、密集恐惧等；</p>
            <p>11、地域黑，如侮辱性描述、恶意调侃、谩骂某地区人民。</p>
            <p class="decoration"></p>
            <p>处罚方式：删除违规内容, 视情节严重程度，封禁账号相关权限24小时-7天。</p>
        </div>

        <h3>三、P2 - 轻度违规行为</h3>
        <div class="content">
            <p>用户平台内发布的文字、图片、语音及视频等内容，涉及不文明行为、低俗趣味、伪科学等内容时，定义为P2级违规行为。违规内容包括但不限于：</p>
            <p>1、宣扬炫富拜金、奢靡腐化等生活方式的；</p>
            <p>2、过度炒作明星绯闻、娱乐八卦的；</p>
            <p>3、使用粗俗语言、展示恶俗行为、宣扬低俗内容的；</p>
            <p>4、使用夸张标题，内容与标题严重不符的；</p>
            <p>5、不文明的行为，如禁烟场所吸烟、妨碍导盲犬、随地吐痰、损坏公共设施等；</p>
            <p>6、违背科学常识的内容，如在食品安全、健康养生等领域发布已被官方或权威机构辟谣的内容；</p>
            <p>7、易引人模仿的危险行为，如危险驾驶车辆、不当使用明火、自残等；</p>
            <p>8、无安全提示、无防护措施的危险行为，如无提示的极限运动、无防护措施的高空行为等；</p>
            <p>9、无故指责平台、无端漫骂、因使用体验导致的恶意吐槽，恶意举报其他用户正常内容等；</p>
            <p>10、恶意中伤或损害人民军队、国安、警察、行政、司法等国家公务人员形象和共产党党员形象的内容；</p>
            <p class="decoration"></p>
            <p>处罚方式：首次违规，删除违规内容并警告用户；再次违规，视违规情节严重性，封禁账号相关权限0.5小时-12小时。</p>
            <p class="decoration"></p>
            <p>本规范自公布之日起执行。关于本规范的修改建议和意见，可以发送至邮箱support@vmloft.cn。</p>
            <p class="decoration"></p>
        </div>
    </div>
</template>

<script lang="ts" setup>
</script>

<!-- 添加“scoped”属性以将 CSS 仅限于此组件 -->
<style lang="scss" scoped>
h2 {
    font-size: 24px;
    font-weight: 600;
    margin: 16px auto 8px;
    padding-left: 16px;
    padding-right: 16px;
}

h3 {
    font-size: 18px;
    font-weight: 600;
    margin: 16px auto 8px;
    padding-left: 16px;
    padding-right: 16px;
}

h4 {
    font-size: 14px;
    font-weight: 500;
    margin: 16px auto 8px;
    padding-left: 16px;
    padding-right: 16px;
}

.content {
    font-size: 14px;
    padding-left: 16px;
    padding-right: 16px;

    p {
        text-indent: 2em;
        padding: 4px 16px;
    }
}

.point {
    font-weight: 600;
}

p {
    font-size: 14px;
    padding-left: 16px;
    padding-right: 16px;
}

.decoration {
    height: 16px;
    padding: 16px;
    text-align: center;
}
</style>
