<template>
    <div class="page">
        <h2>忘忧大陆 隐私政策</h2>
        <div class="content">
            <div>更新日期：2022/03/30</div>
            <div>生效日期：2022/03/30</div>
        </div>

        <h2>引言</h2>
        <div class="content">欢迎您访问"我们"的产品。
            <strong>忘忧大陆</strong>（包括App等产品提供的服务，以下简称“产品和服务”）是由
            <strong>XXXX</strong>（以下简称"我们"）开发并运营的。 确保用户的数据安全和隐私保护是"我们"的首要任务， 本隐私政策载明了您访问和使用"我们"的产品和服务时所收集的数据及其处理方式。
        </div>
        <div class="content">请您在继续使用"我们"的产品前务必认真仔细阅读并确认充分理解本隐私政策全部规则和要点，
            一旦您选择使用，即视为您同意本隐私政策的全部内容，同意"我们"按其收集和使用您的相关信息。 如您在在阅读过程中，对本政策有任何疑问，可联系"我们"的客服咨询， 请通过
            <strong>nepenthe@vmloft.com</strong>或产品中的反馈方式与"我们"取得联系。 如您不同意相关协议或其中的任何条款的，您应停止使用"我们"的产品和服务。
        </div>

        <h2>目录</h2>
        <div class="content">本隐私政策帮助您了解以下内容：
            <div>一、"我们"如何收集和使用您的个人信息</div>
            <div>二、"我们"如何存储和保护您的个人信息</div>
            <div>三、"我们"如何共享、转让、公开披露您的个人信息</div>
            <div>四、"我们"如何使用 Cookie 和其他追踪技术</div>
            <div>五、"我们"使用的三方服务</div>
            <div>六、退出使用"我们"的服务</div>
            <div>七、如何联系"我们"</div>
            <div>八、对此隐私策略的更改</div>
        </div>

        <h3>一、"我们"如何收集和使用您的个人信息</h3>
        <div class="content">个人信息是指以电子或者其他方式记录的能够单独或者与其他信息， 结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
            "我们"根据《中华人民共和国网络安全法》和《信息安全技术个人信息安全规范》（GB/T 35273-2017） 以及其它相关法律法规的要求，并严格遵循正当、合法、必要的原则，
            出于您使用"我们"提供的服务和/或产品等过程中而收集和使用您的个人信息，包括但不限于电子邮箱地址等。
        </div>
        <div class="content">为接受"我们"全面的产品服务，您应首先注册一个用户账号，"我们"将通过它记录相关的数据。
            您所提供的所有信息均来自于您本人在注册时提供的数据。 您准备使用的账户名、密码、您本人的联系方式， "我们"可能通过发短信或者邮件的方式来验证您的身份是否有效。
        </div>

        <h3>二、"我们"如何存储和保护您的个人信息</h3>
        <div class="content">作为一般规则，"我们"仅在实现信息收集目的所需的时间内保留您的个人信息。
            "我们"会在对于管理与您之间的关系严格必要的时间内保留您的个人信息 （例如，当您开立帐户，从"我们"的产品获取服务时）。 出于遵守法律义务或为证明某项权利或合同满足适用的诉讼时效要求的目的，
            "我们"可能需要在上述期限到期后保留您存档的个人信息，并且无法按您的要求删除。
            <span>当您的个人信息对于"我们"的法定义务或法定时效对应的目的或档案不再必要时， "我们"确保将其完全删除或匿名化。</span>
            <span>如果您确认不再使用"我们"的产品和服务，并按照要求主动注销了您的账户，所有信息将被完全删除。</span>
        </div>
        <div class="content">"我们"使用符合业界标准的安全防护措施保护您提供的个人信息，并加密其中的关键数据，
            防止其遭到未经授权访问、公开披露、使用、修改、损坏或丢失。"我们"会采取一切合理可行的措施，保护您的个人信息。 "我们"会使用加密技术确保数据的保密性；"我们"会使用受信赖的保护机制防止数据遭到恶意攻击。
        </div>
        <div class="content">值得一提的是，为了加强对隐私数据的保护，"我们"在收集时就已对其进行了脱敏处理，
            即使在"我们"自己的数据库中，也不会储存具有关联性的、明文的隐私数据。
        </div>

        <h3>三、"我们"如何共享、转让、公开披露您的个人信息</h3>
        <div class="content">在管理"我们"的日常业务活动所需要时，为追求合法利益以更好地服务客户，
            "我们"将合规且恰当的使用您的个人信息。出于对业务和各个方面的综合考虑， "我们"仅自身使用这些数据，不与任何第三方分享。
        </div>
        <div class="content">"我们"可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
            在符合法律法规的前提下，当"我们"收到上述披露信息的请求时，"我们"会要求必须出具与之相应的法律文件，如传票或调查函。 "我们"坚信，对于要求"我们"提供的信息，应该在法律允许的范围内尽可能保持透明。
        </div>
        <div class="content">在以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：
            <div>1、与国家安全、国防安全直接相关的；</div>
            <div>2、与犯罪侦查、起诉、审判和判决执行等直接相关的；</div>
            <div>3、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</div>
            <div>4、您自行向社会公众公开的个人信息；</div>
            <div>5、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</div>
            <div>6、根据个人信息主体要求签订和履行合同所必需的；</div>
            <div>7、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</div>
            <div>8、法律法规规定的其他情形。</div>
        </div>

        <h3>四、"我们"如何使用 Cookie 和其他追踪技术</h3>
        <div class="content">为确保产品正常运转，"我们"会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。 Cookie
            通常包含标识符、产品名称以及一些号码和字符。 借助于 Cookie，"我们"能够存储您的偏好或商品等数据，并用以判断注册用户是否已经登录， 提升服务和产品质量及优化用户体验。
        </div>
        <div class="content">"我们"出于不同的目的使用各种Cookie，包括：严格必要型Cookie、性能Cookie、营销Cookie和功能Cookie。
            某些Cookie可能由外部第三方提供，以向"我们"的产品提供其它功能。 "我们"不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。
            您可以清除计算机上或手机中保存的所有
            Cookie，大部分网络浏览器都设有阻止或禁用 Cookie 的功能， 您可对浏览器进行配置。阻止或禁用 Cookie 功能后，可能影响您使用或不能充分使用"我们"的产品和服务。
        </div>

        <h3>五、"我们"使用的三方服务</h3>
        <div class="content">
            <p>"我们"产品使用第三方统计，您需要一并同意第三方服务商提供的隐私政策；</p>
            <router-link to="/thirdSDK" target="_blank">查看三方服务清单</router-link>
        </div>

        <h3>六、退出使用"我们"的服务</h3>
        <div class="content">
            根据本隐私政策，您可以主动注销您的账户，从"我们"的服务器中删除与您有关的所有数据，而且可以从您的每台设备上卸载所有应用程序并停止使用本产品，从而永远自由地选择不参与将来在软件内收集您的个人信息。
        </div>

        <h3>七、如何联系"我们"</h3>
        <div class="content">如果您在使用"我们"的产品或服务过程中，或者对本隐私政策有任何疑问，可以通过以下方式联系"我们"：</div>
        <div class="content">1、通过邮件：template@vmloft.com</div>
        <div class="content">2、通过产品内部反馈功能</div>

        <h3>八、对此隐私策略的更改</h3>
        <div class="content">
            "我们"可能会不时更新"我们"的隐私政策。"我们"将通过在此页面上发布新的隐私政策来通知您任何更改。建议您定期查看本隐私政策以了解任何变更。本隐私政策的更改在此页面上发布时生效。
        </div>
        <h3></h3>
    </div>
</template>

<script lang="ts" setup>
</script>

<!-- 添加“scoped”属性以将 CSS 仅限于此组件 -->
<style lang="scss" scoped>
h2 {
    font-size: 24px;
    font-weight: 600;
    margin: 16px auto 8px;
    padding-left: 16px;
    padding-right: 16px;
}

h3 {
    font-size: 16px;
    font-weight: 600;
    margin: 16px auto 8px;
    padding-left: 16px;
    padding-right: 16px;
}

.content {
    font-size: 14px;
    padding-left: 16px;
    padding-right: 16px;
}
</style>
